/* automatically generated by rust-bindgen 0.59.2 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type size_t = ::std::os::raw::c_ulonglong;
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize);
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub const FFT_ERROR_CODE_FFT_ERROR_CODE_OK: FFT_ERROR_CODE = 0;
pub const FFT_ERROR_CODE_FFT_ERROR_CODE_IN_SIZE: FFT_ERROR_CODE = 1;
pub const FFT_ERROR_CODE_FFT_ERROR_CODE_OUT_SIZE: FFT_ERROR_CODE = 2;
pub const FFT_ERROR_CODE_FFT_ERROR_CODE_CL: FFT_ERROR_CODE = 3;
pub const FFT_ERROR_CODE_FFT_ERROR_CODE_DIM_TOO_BIG: FFT_ERROR_CODE = 4;
pub const FFT_ERROR_CODE_FFT_ERROR_CODE_NO_CL_DEVICE: FFT_ERROR_CODE = 5;
pub const FFT_ERROR_CODE_FFT_ERROR_CODE_VKFFT: FFT_ERROR_CODE = 6;
pub type FFT_ERROR_CODE = ::std::os::raw::c_int;
pub const FFT_SIGN_FFT_SIGN_FORWARD: FFT_SIGN = 0;
pub const FFT_SIGN_FFT_SIGN_BACKWARD: FFT_SIGN = 1;
pub type FFT_SIGN = ::std::os::raw::c_int;
pub const FFT_DEVICE_FFT_DEVICE_CPU: FFT_DEVICE = 0;
pub const FFT_DEVICE_FFT_DEVICE_GPU: FFT_DEVICE = 1;
pub type FFT_DEVICE = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTPlanFloat {
    pub ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_FFTPlanFloat() {
    assert_eq!(
        ::std::mem::size_of::<FFTPlanFloat>(),
        8usize,
        concat!("Size of: ", stringify!(FFTPlanFloat))
    );
    assert_eq!(
        ::std::mem::align_of::<FFTPlanFloat>(),
        8usize,
        concat!("Alignment of ", stringify!(FFTPlanFloat))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FFTPlanFloat>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FFTPlanFloat),
            "::",
            stringify!(ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTPlanDouble {
    pub ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_FFTPlanDouble() {
    assert_eq!(
        ::std::mem::size_of::<FFTPlanDouble>(),
        8usize,
        concat!("Size of: ", stringify!(FFTPlanDouble))
    );
    assert_eq!(
        ::std::mem::align_of::<FFTPlanDouble>(),
        8usize,
        concat!("Alignment of ", stringify!(FFTPlanDouble))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FFTPlanDouble>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FFTPlanDouble),
            "::",
            stringify!(ptr)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FFTPlanDoubleR2C {
    pub ptr: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_FFTPlanDoubleR2C() {
    assert_eq!(
        ::std::mem::size_of::<FFTPlanDoubleR2C>(),
        8usize,
        concat!("Size of: ", stringify!(FFTPlanDoubleR2C))
    );
    assert_eq!(
        ::std::mem::align_of::<FFTPlanDoubleR2C>(),
        8usize,
        concat!("Alignment of ", stringify!(FFTPlanDoubleR2C))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<FFTPlanDoubleR2C>())).ptr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(FFTPlanDoubleR2C),
            "::",
            stringify!(ptr)
        )
    );
}
pub type ComplexF = [f32; 2usize];
pub type ComplexD = [f64; 2usize];
pub type ComplexL = [f32; 2usize];
extern "C" {
    pub fn fft_new_plan_float(
        dim: i32,
        shape: *const i32,
        number_batches: i32,
        sign: FFT_SIGN,
        device: FFT_DEVICE,
        in_complex: *mut ComplexF,
        in_size: u64,
        out_complex: *mut ComplexF,
        out_size: u64,
        err: *mut FFT_ERROR_CODE,
    ) -> FFTPlanFloat;
}
extern "C" {
    pub fn fft_plan_device_name(
        plan: FFTPlanFloat,
        name: *mut ::std::os::raw::c_char,
        size: ::std::os::raw::c_int,
    ) -> FFT_ERROR_CODE;
}
extern "C" {
    pub fn fft_close_plan(plan: FFTPlanFloat);
}
extern "C" {
    pub fn fft_execute(plan: FFTPlanFloat) -> FFT_ERROR_CODE;
}
